{
  "title": "File System Hierarchy",
  "description": "Understand the Linux file system hierarchy.",
  "image": "/lesson3.jpeg",
  "backgroundColor": "#f2e1cd",
  "textColor": "#333",
  "primaryColor": "#e98102",
  "secondaryColor": "#d77704",
  "sections": [
    {
      "type": "hero",
      "text": "Explore the Linux file system hierarchy!"
    },
    {
      "type": "paragraph",
      "text": "The Linux file system follows a hierarchical structure, with the root directory (`/`) at the top. Understanding the file system hierarchy is crucial for navigating and managing your Linux system effectively."
    },
    {
      "type": "heading",
      "level": 2,
      "text": "The Root Directory (`/`)"
    },
    {
      "type": "paragraph",
      "text": "The root directory is the top-level directory in the Linux file system. It is represented by a forward slash (`/`). All other directories and files are located under the root directory."
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Important Directories"
    },
    {
      "type": "list",
      "items": [
        {
          "type": "listItem",
          "text": "/bin: Contains essential command binaries that are accessible to all users."
        },
        {
          "type": "listItem",
          "text": "/etc: Stores system configuration files."
        },
        {
          "type": "listItem",
          "text": "/home: Contains user home directories, where each user's personal files and settings are stored."
        },
        {
          "type": "listItem",
          "text": "/lib: Houses shared libraries and kernel modules required by the system."
        },
        {
          "type": "listItem",
          "text": "/media: Serves as a mount point for removable media devices, such as USB drives and CDs/DVDs."
        },
        {
          "type": "listItem",
          "text": "/mnt: Provides a temporary mount point for manually mounting file systems."
        },
        {
          "type": "listItem",
          "text": "/opt: Used for installing optional software packages that are not part of the system's default installation."
        },
        {
          "type": "listItem",
          "text": "/proc: Contains a virtual file system that provides information about running processes and system information."
        },
        {
          "type": "listItem",
          "text": "/root: Serves as the home directory for the root user (system administrator)."
        },
        {
          "type": "listItem",
          "text": "/sbin: Contains system binaries and administrative commands that are typically used by the root user."
        },
        {
          "type": "listItem",
          "text": "/tmp: Provides a location for storing temporary files. Files in this directory are usually deleted upon system reboot."
        },
        {
          "type": "listItem",
          "text": "/usr: Contains user utilities, applications, and read-only data files."
        },
        {
          "type": "listItem",
          "text": "/var: Holds variable data files, such as log files, spool files, and temporary files generated by the system."
        }
      ]
    },
    {
      "type": "heading",
      "level": 2,
      "text": "Navigating the File System"
    },
    {
      "type": "paragraph",
      "text": "To navigate the Linux file system, you can use various commands in the terminal. Here are a few essential commands:"
    },
    {
      "type": "code",
      "language": "bash",
      "code": "cd /path/to/directory # Change directory to the specified path\nls # List files and directories in the current directory\nls -l # List files and directories with detailed information\npwd # Print the current working directory"
    },
    {
      "type": "paragraph",
      "text": "Examples:"
    },
    {
      "type": "code",
      "language": "bash",
      "code": "cd /etc # Change to the /etc directory\nls -l # List files in the current directory with detailed information\npwd # Print the current working directory"
    },
    {
      "type": "heading",
      "level": 2,
      "text": "File System Permissions"
    },
    {
      "type": "paragraph",
      "text": "Linux uses a permissions system to control access to files and directories. Each file and directory has three types of permissions: read (r), write (w), and execute (x). Permissions are assigned to the owner, group, and others."
    },
    {
      "type": "paragraph",
      "text": "To view the permissions of a file or directory, use the `ls -l` command. The output will show the permissions in the format: `drwxrwxrwx`."
    },
    {
      "type": "list",
      "items": [
        {
          "type": "listItem",
          "text": "The first character indicates the file type: `d` for directory, `-` for regular file."
        },
        {
          "type": "listItem",
          "text": "The next three characters represent the owner permissions: `r` (read), `w` (write), `x` (execute)."
        },
        {
          "type": "listItem",
          "text": "The following three characters represent the group permissions."
        },
        {
          "type": "listItem",
          "text": "The last three characters represent the permissions for others (everyone else)."
        }
      ]
    },
    {
      "type": "paragraph",
      "text": "Understanding the Linux file system hierarchy and permissions is essential for effectively managing and securing your system. By knowing the purpose of each directory and how to navigate through the file system, you can locate and manipulate files and directories with ease."
    }
  ]
}